app/controllers/characters_controller.rb

  def create
    @house = House.find(params[:house_id])
    @character = @house.characters.create(character_params)
---
INSERT INTO "characters" ("name", "character_photo", "house_id") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Donald Trump"], ["character_photo", "http://static4.businessinsider.com/image/56c640526e97c625048b822a-480/donald-trump.jpg"], ["house_id", 1]]

  def show
    @character = Character.find(params[:id])
    @house = House.find(@character.house_id)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def edit
    @character = Character.find(params[:id])
    @house = House.find(@character.house_id)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @character = Character.find(params[:id])
    @character.update(character_params)
    @house = House.find(@character.house_id)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "characters" SET "name" = $1 WHERE "characters"."id" = $2  [["name", "Daenerys Targaryen!"], ["id", 1]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @character = Character.find(params[:id])
    @character.destroy
    @house = House.find(@character.house_id)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 5]]
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]