app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "house_url") VALUES ($1, $2) RETURNING "id"  [["name", "james"], ["house_url", "http://img2.timeinc.net/people/i/2008/gallery/countrydownloadsB/james_house.jpg"]]
---
  def create
    @house = House.create(house_params)

UPDATE "houses" SET "house_url" = $1 WHERE "houses"."id" = $2  [["house_url", "http://vignette1.wikia.nocookie.net/gameofthrones/images/1/16/House-Targaryen-heraldry.jpg/revision/latest?cb=20151004105028"], ["id", 1]]
---
  def update
    @house = House.find(params[:id])
    @house.update(house_params)